---
kind: method
id: M:Autodesk.Revit.DB.CombinableElementArray.Clear
source: html/f21fff3a-7a61-915d-037e-ea6fd6fbd53f.htm
---
# Autodesk.Revit.DB.CombinableElementArray.Clear Method

Removes every CombinableElement from the array, rendering it empty.

## Syntax (C#)
```csharp
public virtual void Clear()
```